{
  "S_L": 0,
  "S_R": 0,
  "ablate_ecd": false,
  "auto_mapping": {
    "base_model_class": "OPTForCausalLM",
    "parent_library": "transformers.models.opt.modeling_opt"
  },
  "base_model_name_or_path": "/home/jqh/.cache/huggingface/hub/models--facebook--opt-350m/snapshots/08ab08cc4b72ff5593870b5d527cf4230323703c",
  "block_size": 4,
  "chunk_size": 512,
  "core": "diag",
  "core_init_std": 0.005,
  "ddp_allow_unused_parameters": true,
  "ecd_alpha": 0.5,
  "ecd_learnable_energy": false,
  "ecd_temp_annealing": false,
  "ecd_temp_end": 1.0,
  "ecd_temp_start": 5.0,
  "ecd_temperature": 1.0,
  "ema_beta": 0.98,
  "ema_grad_interval": 1,
  "ema_update_interval": 1,
  "eps": 1e-08,
  "exclude_modules": null,
  "force_random_rotation_init": true,
  "gumbel_tau": 1.0,
  "inference_mode": true,
  "k": 8,
  "lowrank_alpha": null,
  "lowrank_r": 8,
  "lr_core": 0.05,
  "lr_theta": 0.05,
  "magnitude": "none",
  "magnitude_init_scale": 1.0,
  "magnitude_lr_scale": 1.0,
  "max_angle": 0.1,
  "modules_to_save": null,
  "oer_temperature": 1.0,
  "pairing_strategy": "consecutive",
  "pairs_freeze_after_warmup": false,
  "peft_type": "JORA",
  "peft_version": "0.18.1.dev0@UNKNOWN",
  "revision": null,
  "rotation_impl": "auto",
  "rotation_param": "cayley",
  "selection": "none",
  "selection_group_by": "dimension",
  "selection_group_size": 1,
  "single_sided": "none",
  "t_stat": 0,
  "target_modules": [
    "fc2",
    "k_proj",
    "v_proj",
    "q_proj",
    "out_proj",
    "project_in",
    "fc1",
    "project_out"
  ],
  "target_parameters": null,
  "task_type": null,
  "theta_init_std": 0.002,
  "update_interval": 1,
  "use_cayley": null,
  "use_ecd": false,
  "use_fast_ecd": false,
  "use_gumbel": false,
  "use_optimized_pair_selection": true,
  "use_parallel_rotations": false,
  "warmup_ratio": 0.0,
  "warmup_steps": 0,
  "zero_init_core": true
}