{
  "name": "Main Experiment Configuration (Recommended)",
  "description": "基于预实验结果，推荐的 Block 主实验配置",
  "priority": "P0 - 主实验配置",
    "peft_type": "JORA",
    "target_modules": ["q_proj", "v_proj"],
    "core": "block",
    "block_size": 4,
    "S_L": 96,
    "S_R": 96,
    "k": 24,
    "rotation_param": "cayley",
    "rotation_impl": "auto",
    "max_angle": 0.1,
    "force_random_rotation_init": true,
    "theta_init_std": 0.02,
    "selection": "topk_ema",
    "ema_beta": 0.95,
    "update_interval": 50,
    "ema_update_interval": 50,
    "magnitude": "oer_softmax",
    "oer_temperature": 2.0,
    "lr_theta": 0.05,
    "lr_core": 0.01,
    "inference_mode": false,
  "ddp_allow_unused_parameters": true,
  "estimated_params": "~115K (A轨 7 modules)",
  "notes": "这是推荐的主实验配置，Block 能力最强，在 Phase 1-4 扫描后可能需要微调"
}
